spring-soap-ws/src/main/resources/request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
				  xmlns:gs="http://spring.io/guides/gs-producing-web-service">
   <soapenv:Header/>
   <soapenv:Body>
      <gs:getPaisRequest>
         <gs:nome>Brasil</gs:nome>
      </gs:getPaisRequest>
   </soapenv:Body>
</soapenv:Envelope>

